#include <stdio.h>
int main(){
	char a[1000];
	int i;
	scanf("%[^\n]]",a);
	for(i=0;a[i]!='\0';i++){
		if('a'<=a[i]&&a[i]<='z'||'A'<=a[i]&&a[i]<='Z'){
			if(a[i]<='z'&&'w'<=a[i]||a[i]<='Z'&&'W'<=a[i]){
				a[i]=a[i]-26+4;
			}
			else{
				a[i]+=4;
			}
		}
	}
	for(i=0;a[i]!='\0';i++){
		printf("%c",a[i]);
	}
}


/*
B: 电文加密
给电文加密。加密规则是对于每一个字符，如果是字母，变换成其相应的其后（循环的字母序，即A紧跟在Z的后面）的第4个字母。例如A变成E，a变成e，W变成A，X变成B，Y变成C，Z变成D。如果不是字母，则不进行变换。

 

输入
 

输入一行字符(长度小于100)。

 

输出
 

输出相应的密码。



样例输入

China!



样例输出

Glmre!
*/
